uat_chat/Reports/уатОтчетПоМоточасам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>уатОтчетПоМоточасам</Name>
			<Comment>Отчет по наработке оборудования в моточасах (уат)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.уатУниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

uat_chat/AccumulationRegisters/уатВыработкаТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>уатВыработкаТС</Name>
			<Comment>Выработка транспортных средств (уат)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧасовНаЗаказчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прейскурант</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Comment>ТС или оборудование</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПачки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

uat_chat/Catalogs/уатПараметрыВыработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>уатПараметрыВыработки</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработкиОС</Name>
					<Comment>Параметр выработки ОС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыВыработкиОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмРасчетаПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПараметра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ItobВидыПараметровВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетНаТС</Name>
					<Comment>Действует на ТС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетНаСотрудников</Name>
					<Comment>Действует на сотрудников</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВТарифахНаУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьПоДаннымДатчиковТелеметрии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриПланировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесовойКоэффициентЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеДатчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobНазначенияДатчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Временный</Name>
					<Comment>Признак того, что параметр временной</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаПараметровВыработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСпособРасчетаПараметровВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетНаГСМ</Name>
					<Comment>Действует на расход ГСМ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УсловияОтбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ItobНазначенияДатчиков</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ItobВидыСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ItobСостоянияТерминалов</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

uat_chat/Reports/уатОтчетПоМоточасам/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
//=================================================================================
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА


// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		
		//уатОбщегоНазначения.уатВосстановитьРеквизитыОтчета(ЭтотОбъект, ДополнительныеПараметры);
		
	КонецЕсли;
	
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ТС КАК ТС,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.Контрагент КАК Контрагент,
	|	ВложенныйЗапрос.ВыработкаЗаПериод КАК МоточасыЗаПериод,
	|	ВложенныйЗапрос.ВыработкаВсего КАК МоточасыВсего,
	|	ВложенныйЗапрос.ТС.ГосударственныйНомер КАК ТСГосНомер,
	|	ВложенныйЗапрос.ТС.ГаражныйНомер КАК ТСГарНомер,
	|	ВложенныйЗапрос.ВыработкаДоПериода КАК МоточасыДоПериода,
	|	ВложенныйЗапрос.ПериодДень КАК ПериодДень,
	|	ВложенныйЗапрос.ПериодНеделя КАК ПериодНеделя,
	|	ВложенныйЗапрос.ПериодДекада КАК ПериодДекада,
	|	ВложенныйЗапрос.ПериодМесяц КАК ПериодМесяц,
	|	ВложенныйЗапрос.ПериодКвартал КАК ПериодКвартал,
	|	ВложенныйЗапрос.ПериодПолугодие КАК ПериодПолугодие,
	|	ВложенныйЗапрос.ПериодГод КАК ПериодГод,
	|	ВложенныйЗапрос.Регистратор КАК Регистратор,
	|	ВложенныйЗапрос.ВыработкаЗаПериодИтоги,
	|	ВложенныйЗапрос.ВыработкаВсегоИтоги,
	|	ВложенныйЗапрос.ВыбработкаДоПериодаИтоги,
	|	ВложенныйЗапрос.ОбъектСтроительства КАК ОбъектСтроительства
	|{ВЫБРАТЬ
	|	Организация.*,
	|	ТС.*,
	|	Подразделение.*,
	|	Контрагент.*,
	|	ВложенныйЗапрос.ВыработкаДоПериода КАК МоточасыДоПериода,
	|	ВложенныйЗапрос.ВыработкаЗаПериод КАК МоточасыЗаПериод,
	|	ВложенныйЗапрос.ВыработкаВсего КАК МоточасыВсего,
	|	ТСГосНомер,
	|	ТСГарНомер,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Регистратор.*,
	|	ОбъектСтроительства.*}
	|ИЗ
	|	(ВЫБРАТЬ
	|		уатВыработкаТСОбороты.Организация КАК Организация,
	|		уатВыработкаТСОбороты.ТС КАК ТС,
	|		уатВыработкаТСОбороты.Подразделение КАК Подразделение,
	|		уатВыработкаТСОбороты.Контрагент КАК Контрагент,
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, ДЕНЬ) КАК ПериодДень,
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, ДЕКАДА) КАК ПериодДекада,
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, МЕСЯЦ) КАК ПериодМесяц,
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, КВАРТАЛ) КАК ПериодКвартал,
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, ГОД) КАК ПериодГод,
	|		уатВыработкаТСОбороты.Регистратор КАК Регистратор,
	|		0 КАК ВыработкаДоПериода,
	|		ВЫБОР
	|			КОГДА &ВыводитьВремяВФорматеЧЧММ
	|				ТОГДА ВЫБОР
	|						КОГДА (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - уатВыработкаТСОбороты.КоличествоОборот / 3600 > 0
	|							ТОГДА (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - 1
	|						ИНАЧЕ ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))
	|					КОНЕЦ + (ВЫРАЗИТЬ(ВЫБОР
	|							КОГДА (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - уатВыработкаТСОбороты.КоличествоОборот / 3600 > 0
	|								ТОГДА уатВыработкаТСОбороты.КоличествоОборот / 3600 - ((ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - 1)
	|							ИНАЧЕ уатВыработкаТСОбороты.КоличествоОборот / 3600 - (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0)))
	|						КОНЕЦ * 60 / 100 КАК ЧИСЛО(15, 2)))
	|			ИНАЧЕ ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 2))
	|		КОНЕЦ КАК ВыработкаЗаПериод,
	|		0 КАК ВыработкаВсего,
	|		ВЫБОР
	|			КОГДА &ВыводитьВремяВФорматеЧЧММ
	|				ТОГДА ВЫБОР
	|						КОГДА (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - уатВыработкаТСОбороты.КоличествоОборот / 3600 > 0
	|							ТОГДА (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - 1
	|						ИНАЧЕ ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))
	|					КОНЕЦ * 60 + ВЫБОР
	|						КОГДА (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - уатВыработкаТСОбороты.КоличествоОборот / 3600 > 0
	|							ТОГДА уатВыработкаТСОбороты.КоличествоОборот / 3600 - ((ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - 1)
	|						ИНАЧЕ уатВыработкаТСОбороты.КоличествоОборот / 3600 - (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0)))
	|					КОНЕЦ * 60
	|			ИНАЧЕ ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 2))
	|		КОНЕЦ КАК ВыработкаЗаПериодИтоги,
	|		0 КАК ВыбработкаДоПериодаИтоги,
	|		0 КАК ВыработкаВсегоИтоги,
	|		уатВыработкаТСОбороты.ОбъектСтроительства КАК ОбъектСтроительства
	|	ИЗ
	|		РегистрНакопления.уатВыработкаТС.Обороты(
	|				&ДатаНач,
	|				&ДатаКон,
	|				Регистратор,
	|				ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ВремяВРаботе)
	|					И НЕ ТС.Модель.НаличиеСпидометра) КАК уатВыработкаТСОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		уатВыработкаТСОбороты.Организация,
	|		уатВыработкаТСОбороты.ТС,
	|		уатВыработкаТСОбороты.Подразделение,
	|		уатВыработкаТСОбороты.Контрагент,
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, ДЕНЬ),
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, НЕДЕЛЯ),
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, ДЕКАДА),
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, МЕСЯЦ),
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, КВАРТАЛ),
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, ПОЛУГОДИЕ),
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, ГОД),
	|		уатВыработкаТСОбороты.Регистратор,
	|		ВЫБОР
	|			КОГДА &ДатаНачала = &ПустаяДата
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &ВыводитьВремяВФорматеЧЧММ
	|						ТОГДА ВЫБОР
	|								КОГДА (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - уатВыработкаТСОбороты.КоличествоОборот / 3600 > 0
	|									ТОГДА (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ + (ВЫРАЗИТЬ(ВЫБОР
	|									КОГДА (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - уатВыработкаТСОбороты.КоличествоОборот / 3600 > 0
	|										ТОГДА уатВыработкаТСОбороты.КоличествоОборот / 3600 - ((ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - 1)
	|									ИНАЧЕ уатВыработкаТСОбороты.КоличествоОборот / 3600 - (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0)))
	|								КОНЕЦ * 60 / 100 КАК ЧИСЛО(15, 2)))
	|					ИНАЧЕ ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 2))
	|				КОНЕЦ
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА &ДатаНачала = &ПустаяДата
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &ВыводитьВремяВФорматеЧЧММ
	|						ТОГДА ВЫБОР
	|								КОГДА (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - уатВыработкаТСОбороты.КоличествоОборот / 3600 > 0
	|									ТОГДА (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - 1
	|								ИНАЧЕ ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ * 60 + ВЫБОР
	|								КОГДА (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - уатВыработкаТСОбороты.КоличествоОборот / 3600 > 0
	|									ТОГДА уатВыработкаТСОбороты.КоличествоОборот / 3600 - ((ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - 1)
	|								ИНАЧЕ уатВыработкаТСОбороты.КоличествоОборот / 3600 - (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0)))
	|							КОНЕЦ * 60
	|					ИНАЧЕ ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 2))
	|				КОНЕЦ
	|		КОНЕЦ,
	|		0,
	|		уатВыработкаТСОбороты.ОбъектСтроительства
	|	ИЗ
	|		РегистрНакопления.уатВыработкаТС.Обороты(
	|				,
	|				ДОБАВИТЬКДАТЕ(&ДатаНачала, СЕКУНДА, -1),
	|				Регистратор,
	|				ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ВремяВРаботе)
	|					И НЕ ТС.Модель.НаличиеСпидометра) КАК уатВыработкаТСОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		уатВыработкаТСОбороты.Организация,
	|		уатВыработкаТСОбороты.ТС,
	|		уатВыработкаТСОбороты.Подразделение,
	|		уатВыработкаТСОбороты.Контрагент,
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, ДЕНЬ),
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, НЕДЕЛЯ),
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, ДЕКАДА),
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, МЕСЯЦ),
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, КВАРТАЛ),
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, ПОЛУГОДИЕ),
	|		НАЧАЛОПЕРИОДА(уатВыработкаТСОбороты.Период, ГОД),
	|		уатВыработкаТСОбороты.Регистратор,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА &ВыводитьВремяВФорматеЧЧММ
	|				ТОГДА ВЫБОР
	|						КОГДА (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - уатВыработкаТСОбороты.КоличествоОборот / 3600 > 0
	|							ТОГДА (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - 1
	|						ИНАЧЕ ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))
	|					КОНЕЦ + (ВЫРАЗИТЬ(ВЫБОР
	|							КОГДА (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - уатВыработкаТСОбороты.КоличествоОборот / 3600 > 0
	|								ТОГДА уатВыработкаТСОбороты.КоличествоОборот / 3600 - ((ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - 1)
	|							ИНАЧЕ уатВыработкаТСОбороты.КоличествоОборот / 3600 - (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0)))
	|						КОНЕЦ * 60 / 100 КАК ЧИСЛО(15, 2)))
	|			ИНАЧЕ ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 2))
	|		КОНЕЦ,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА &ВыводитьВремяВФорматеЧЧММ
	|				ТОГДА ВЫБОР
	|						КОГДА (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - уатВыработкаТСОбороты.КоличествоОборот / 3600 > 0
	|							ТОГДА (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - 1
	|						ИНАЧЕ ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))
	|					КОНЕЦ * 60 + ВЫБОР
	|						КОГДА (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - уатВыработкаТСОбороты.КоличествоОборот / 3600 > 0
	|							ТОГДА уатВыработкаТСОбороты.КоличествоОборот / 3600 - ((ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0))) - 1)
	|						ИНАЧЕ уатВыработкаТСОбороты.КоличествоОборот / 3600 - (ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 0)))
	|					КОНЕЦ * 60
	|			ИНАЧЕ ВЫРАЗИТЬ(уатВыработкаТСОбороты.КоличествоОборот / 3600 КАК ЧИСЛО(15, 2))
	|		КОНЕЦ,
	|		уатВыработкаТСОбороты.ОбъектСтроительства
	|	ИЗ
	|		РегистрНакопления.уатВыработкаТС.Обороты(
	|				,
	|				,
	|				Регистратор,
	|				ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ВремяВРаботе)
	|					И НЕ ТС.Модель.НаличиеСпидометра) КАК уатВыработкаТСОбороты
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СправочникуатТС.Организация,
	|		СправочникуатТС.Ссылка,
	|		СправочникуатТС.Подразделение,
	|		NULL,
	|		ДАТАВРЕМЯ(1,1,1),
	|		ДАТАВРЕМЯ(1,1,1),
	|		ДАТАВРЕМЯ(1,1,1),
	|		ДАТАВРЕМЯ(1,1,1),
	|		ДАТАВРЕМЯ(1,1,1),
	|		ДАТАВРЕМЯ(1,1,1),
	|		ДАТАВРЕМЯ(1,1,1),
	|		NULL,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА &ВыводитьВремяВФорматеЧЧММ
	|				ТОГДА ВЫБОР
	|						КОГДА (ВЫРАЗИТЬ(СправочникуатТС.НачальнаяНаработка КАК ЧИСЛО(15, 0))) - СправочникуатТС.НачальнаяНаработка > 0
	|							ТОГДА (ВЫРАЗИТЬ(СправочникуатТС.НачальнаяНаработка КАК ЧИСЛО(15, 0))) - 1
	|						ИНАЧЕ ВЫРАЗИТЬ(СправочникуатТС.НачальнаяНаработка КАК ЧИСЛО(15, 0))
	|					КОНЕЦ + (ВЫРАЗИТЬ(ВЫБОР
	|							КОГДА (ВЫРАЗИТЬ(СправочникуатТС.НачальнаяНаработка КАК ЧИСЛО(15, 0))) - СправочникуатТС.НачальнаяНаработка > 0
	|								ТОГДА СправочникуатТС.НачальнаяНаработка - ((ВЫРАЗИТЬ(СправочникуатТС.НачальнаяНаработка КАК ЧИСЛО(15, 0))) - 1)
	|							ИНАЧЕ СправочникуатТС.НачальнаяНаработка - (ВЫРАЗИТЬ(СправочникуатТС.НачальнаяНаработка КАК ЧИСЛО(15, 0)))
	|						КОНЕЦ * 60 / 100 КАК ЧИСЛО(15, 2)))
	|			ИНАЧЕ ВЫРАЗИТЬ(СправочникуатТС.НачальнаяНаработка КАК ЧИСЛО(15, 2))
	|		КОНЕЦ,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА &ВыводитьВремяВФорматеЧЧММ
	|				ТОГДА ВЫБОР
	|						КОГДА (ВЫРАЗИТЬ(СправочникуатТС.НачальнаяНаработка КАК ЧИСЛО(15, 0))) - СправочникуатТС.НачальнаяНаработка > 0
	|							ТОГДА (ВЫРАЗИТЬ(СправочникуатТС.НачальнаяНаработка КАК ЧИСЛО(15, 0))) - 1
	|						ИНАЧЕ ВЫРАЗИТЬ(СправочникуатТС.НачальнаяНаработка КАК ЧИСЛО(15, 0))
	|					КОНЕЦ * 60 + ВЫБОР
	|						КОГДА (ВЫРАЗИТЬ(СправочникуатТС.НачальнаяНаработка КАК ЧИСЛО(15, 0))) - СправочникуатТС.НачальнаяНаработка > 0
	|							ТОГДА СправочникуатТС.НачальнаяНаработка - ((ВЫРАЗИТЬ(СправочникуатТС.НачальнаяНаработка КАК ЧИСЛО(15, 0))) - 1)
	|						ИНАЧЕ СправочникуатТС.НачальнаяНаработка - (ВЫРАЗИТЬ(СправочникуатТС.НачальнаяНаработка КАК ЧИСЛО(15, 0)))
	|					КОНЕЦ * 60
	|			ИНАЧЕ ВЫРАЗИТЬ(СправочникуатТС.НачальнаяНаработка КАК ЧИСЛО(15, 2))
	|		КОНЕЦ,
	|		NULL
	|	ИЗ
	|		(ВЫБРАТЬ Ссылка, Организация, Подразделение, ЭтоГруппа, Модель, ВЫБОР КОГДА НачальнаяНаработка = 0 ТОГДА НачальныйПробег ИНАЧЕ НачальнаяНаработка КОНЕЦ КАК НачальнаяНаработка ИЗ Справочник.уатТС КАК СправочникуатТСвлож
	|	ГДЕ
	|		(НЕ СправочникуатТСвлож.ЭтоГруппа)
	|		И (СправочникуатТСвлож.НачальнаяНаработка > 0 ИЛИ СправочникуатТСвлож.НачальныйПробег > 0)
	|		И (НЕ СправочникуатТСвлож.Модель.НаличиеСпидометра)) КАК СправочникуатТС) КАК ВложенныйЗапрос
	|{ГДЕ
	|	ВложенныйЗапрос.Организация.*,
	|	ВложенныйЗапрос.ТС.*,
	|	ВложенныйЗапрос.Подразделение.*,
	|	ВложенныйЗапрос.Контрагент.*,
	|	ВложенныйЗапрос.ТС.ГосударственныйНомер КАК ТСГосНомер,
	|	ВложенныйЗапрос.ТС.ГаражныйНомер КАК ТСГарНомер,
	|	ВложенныйЗапрос.ПериодДень,
	|	ВложенныйЗапрос.ПериодНеделя,
	|	ВложенныйЗапрос.ПериодДекада,
	|	ВложенныйЗапрос.ПериодМесяц,
	|	ВложенныйЗапрос.ПериодКвартал,
	|	ВложенныйЗапрос.ПериодПолугодие,
	|	ВложенныйЗапрос.ПериодГод,
	|	ВложенныйЗапрос.Регистратор.*,
	|	(ВЫБОР
	|			КОГДА ВложенныйЗапрос.ТС.ДатаВыбытия <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			КОГДА ВложенныйЗапрос.ТС.ДатаВыбытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ЛОЖЬ
	|		КОНЕЦ) КАК ТСВыбыло,
	|	ВложенныйЗапрос.ОбъектСтроительства.*}
	|{УПОРЯДОЧИТЬ ПО
	|	Организация.*,
	|	ТС.*,
	|	Подразделение.*,
	|	Контрагент.*,
	|	ВложенныйЗапрос.ВыработкаДоПериода КАК МоточасыДоПериода,
	|	ВложенныйЗапрос.ВыработкаВсего КАК МоточасыВсего,
	|	ВложенныйЗапрос.ВыработкаЗаПериод КАК МоточасыЗаПериод,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Регистратор.*,
	|	ОбъектСтроительства.*}
	|ИТОГИ
	|	ВЫБОР
	|		КОГДА &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА (ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВыработкаЗаПериодИтоги) / 60 КАК ЧИСЛО(15, 0))) - СУММА(ВложенныйЗапрос.ВыработкаЗаПериодИтоги) / 60 > 0
	|							ТОГДА (ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВыработкаЗаПериодИтоги) / 60 КАК ЧИСЛО(15, 0))) - 1
	|						ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВыработкаЗаПериодИтоги) / 60 КАК ЧИСЛО(15, 0))
	|					КОНЕЦ + ВЫБОР
	|						КОГДА (ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВыработкаЗаПериодИтоги) / 60 КАК ЧИСЛО(15, 0))) - СУММА(ВложенныйЗапрос.ВыработкаЗаПериодИтоги) / 60 > 0
	|							ТОГДА СУММА(ВложенныйЗапрос.ВыработкаЗаПериодИтоги) / 60 - ((ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВыработкаЗаПериодИтоги) / 60 КАК ЧИСЛО(15, 0))) - 1)
	|						ИНАЧЕ СУММА(ВложенныйЗапрос.ВыработкаЗаПериодИтоги) / 60 - (ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВыработкаЗаПериодИтоги) / 60 КАК ЧИСЛО(15, 0)))
	|					КОНЕЦ * 60 / 100 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ СУММА(ВложенныйЗапрос.ВыработкаЗаПериодИтоги)
	|	КОНЕЦ КАК МоточасыЗаПериод,
	|	ВЫБОР
	|		КОГДА &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА (ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВыработкаВсегоИтоги) / 60 КАК ЧИСЛО(15, 0))) - СУММА(ВложенныйЗапрос.ВыработкаВсегоИтоги) / 60 > 0
	|							ТОГДА (ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВыработкаВсегоИтоги) / 60 КАК ЧИСЛО(15, 0))) - 1
	|						ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВыработкаВсегоИтоги) / 60 КАК ЧИСЛО(15, 0))
	|					КОНЕЦ + ВЫБОР
	|						КОГДА (ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВыработкаВсегоИтоги) / 60 КАК ЧИСЛО(15, 0))) - СУММА(ВложенныйЗапрос.ВыработкаВсегоИтоги) / 60 > 0
	|							ТОГДА СУММА(ВложенныйЗапрос.ВыработкаВсегоИтоги) / 60 - ((ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВыработкаВсегоИтоги) / 60 КАК ЧИСЛО(15, 0))) - 1)
	|						ИНАЧЕ СУММА(ВложенныйЗапрос.ВыработкаВсегоИтоги) / 60 - (ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВыработкаВсегоИтоги) / 60 КАК ЧИСЛО(15, 0)))
	|					КОНЕЦ * 60 / 100 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ СУММА(ВложенныйЗапрос.ВыработкаВсегоИтоги)
	|	КОНЕЦ КАК МоточасыВсего,
	|	ВЫБОР
	|		КОГДА &ВыводитьВремяВФорматеЧЧММ
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА (ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВыбработкаДоПериодаИтоги) / 60 КАК ЧИСЛО(15, 0))) - СУММА(ВложенныйЗапрос.ВыбработкаДоПериодаИтоги) / 60 > 0
	|							ТОГДА (ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВыбработкаДоПериодаИтоги) / 60 КАК ЧИСЛО(15, 0))) - 1
	|						ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВыбработкаДоПериодаИтоги) / 60 КАК ЧИСЛО(15, 0))
	|					КОНЕЦ + ВЫБОР
	|						КОГДА (ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВыбработкаДоПериодаИтоги) / 60 КАК ЧИСЛО(15, 0))) - СУММА(ВложенныйЗапрос.ВыбработкаДоПериодаИтоги) / 60 > 0
	|							ТОГДА СУММА(ВложенныйЗапрос.ВыбработкаДоПериодаИтоги) / 60 - ((ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВыбработкаДоПериодаИтоги) / 60 КАК ЧИСЛО(15, 0))) - 1)
	|						ИНАЧЕ СУММА(ВложенныйЗапрос.ВыбработкаДоПериодаИтоги) / 60 - (ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.ВыбработкаДоПериодаИтоги) / 60 КАК ЧИСЛО(15, 0)))
	|					КОНЕЦ * 60 / 100 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ СУММА(ВложенныйЗапрос.ВыбработкаДоПериодаИтоги)
	|	КОНЕЦ КАК МоточасыДоПериода
	|ПО
	|	ОБЩИЕ,
	|	Организация,
	|	ТС,
	|	Подразделение,
	|	Контрагент,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Регистратор,
	|	ОбъектСтроительства
	|{ИТОГИ ПО
	|	Организация.*,
	|	ТС.*,
	|	Подразделение.*,
	|	Контрагент.*,
	|	ТСГосНомер,
	|	ТСГарНомер,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	Регистратор.*,
	|	ОбъектСтроительства.*}";
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПустаяДата",Дата('00010101'));
	
	ВыводитьВремяВФорматеЧЧММ = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(глЗначениеПеременной("глТекущийПользователь"), ПланыВидовХарактеристик.уатПраваИНастройки.ФорматироватьВремяВОтчетах);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ВыводитьВремяВФорматеЧЧММ", ?(ВыводитьВремяВФорматеЧЧММ, ИСТИНА, ЛОЖЬ));
		
	// В универсальном отчете включен флаг использования свойств и категорий.
	//Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
	//	
	//	// Добавление свойств и категорий поля запроса в таблицу полей.
	//	// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
	//	
	//	// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , 
	//                                                  <ПсевдонимПоля>, <Представление>, <Назначение>);
	//	УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("уатДТП.Заказчик", "Заказчик", "Заказчик", 
	//                                ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
	//	
	//	// Добавление свойств и категорий в исходный текст запроса.
	//	УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
	//	
	//КонецЕсли;
	
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	Пока УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Количество() > 0 Цикл
		
		УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Удалить(УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки[0]);
		
	КонецЦикла;
	
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТС"                 , "ТС / оборудование (все поля)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТСГарНомер"         , "ТС (гар. номер)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТСГосНомер"         , "ТС (гос. номер)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Организация"        , "Организация");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Подразделение"      , "Подразделение");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("МоточасыЗаПериод"   , "Моточасы за период");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("МоточасыДоПериода"  , "Моточасы до периода");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("МоточасыВсего"      , "Моточасы всего");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТСВыбыло"			  , "ТС выбыло");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ОбъектСтроительства", "Объект строительства");
	
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	//// Заполнение начальных настроек универсального отчета
	//УниверсальныйОтчет.УстановитьНачальныеНастройки(Истина);
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Организация");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ТС");
	
	УниверсальныйОтчет.ДобавитьПоказатель("МоточасыДоПериода", "Моточасы до периода", Истина,"ЧДЦ=2", , );
	УниверсальныйОтчет.ДобавитьПоказатель("МоточасыЗаПериод" , "Моточасы за период" , Истина,"ЧДЦ=2", , );
	УниверсальныйОтчет.ДобавитьПоказатель("МоточасыВсего"    , "Моточасы всего"     , Истина,"ЧДЦ=2", , );

	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("ТСВыбыло", Истина, ВидСравнения.Равно, Ложь);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДанным>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	//УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ВыполнениеЗаказовНаТС", "ЗаказНаТС");	
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("ТСГосНомер");
	
	ЭлементУслОформления = УниверсальныйОтчет.ПостроительОтчета.УсловноеОформление.Добавить(""); 
	ЭлементУслОформления.Использование = Истина; 
	ЭлементОбласть = ЭлементУслОформления.Область.Добавить("МоточасыДоПериода", "МоточасыДоПериода", ТипОбластиОформления.Поле); 
	ЭлементОбласть = ЭлементУслОформления.Область.Добавить("МоточасыЗаПериод" , "МоточасыЗаПериод" , ТипОбластиОформления.Поле); 
	ЭлементОбласть = ЭлементУслОформления.Область.Добавить("МоточасыВсего"    , "МоточасыВсего"    , ТипОбластиОформления.Поле); 	
	
	ЭлементОформления = ЭлементУслОформления.Оформление.Формат; 
	ЭлементОформления.Использование = Истина; 
	Если ВыводитьВремяВФорматеЧЧММ Тогда
		ЭлементОформления.Значение = "ЧДЦ=2; ЧРД=:";
	Иначе
		ЭлементОформления.Значение = "ЧДЦ=3; ЧРД=,";
	КонецЕсли;
	
КонецПроцедуры // УстановитьНачальныеНастройки()

//=================================================================================
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 

// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);
	ТабличныйДокумент.ТолькоПросмотр = уатПраваИНастройки.уатПраво("ЗащитаПечатныхФорм", глПраваУАТ);
	
КонецПроцедуры // СформироватьОтчет()

//=================================================================================
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = уатОбщегоНазначения.уатСохранитьРеквизитыОтчета(ЭтотОбъект);
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	уатОбщегоНазначения.уатСохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	уатОбщегоНазначения.уатВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 
// 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
УниверсальныйОтчет.мРежимВводаПериода = 0;

#КонецЕсли
